{
    "data": [
        {
            "project_name": "CuacaWi",
            "path": "cuacawi",
            "thumbnail_description": "Website to get information about weather conditions in a region using the OpenWeather API.",
            "description": [
                "A weather website built using Vue.js with TypeScript and TailwindCSS. This Website aims to show weather information based on the location or region searched by the user, with data obtained through the OpenWeatherAPI.",
                "Through a simple and responsive interface, users can search for weather conditions in various cities around the world. The information displayed includes temperature, humidity, wind speed, sky conditions (sunny, cloudy, rainy, etc.), and the latest weather forecast. In addition, this application also displays dynamic weather icons and adaptive backgrounds according to current weather conditions."
            ],
            "technology": "Vue, Vite, TypeScript, TailwindCSS",
            "year": 2025,
            "link": {
                "project": "https://cuaca-wi.vercel.app",
                "github": {
                    "fe": "https://github.com/Fush1ren/CuacaWi"
                }
            }
        },
        {
            "project_name": "Endang Stock",
            "path": "endang-stock",
            "thumbnail_description": "Website for managing inventory at Agen Sembako Mbak Endang, with real-time stock notification features.",
            "description": [
                "A web-based inventory management system application designed to help streamline the process of managing inventory in a store or warehouse to be more efficient, structured, and accurate. This system was built with a client-server architecture, where the frontend and backend were built using modern technology that supports high performance and scalability.",
                "With the combination of Vue.js, Vite, TypeScript, TailwindCSS, PrimeVue, Express.js, PostgreSQL, Prisma ORM, and Socket.IO technologies, this application is designed to deliver a real-time, fast, secure, and easy-to-use inventory management system. The main objectives of this project are to improve operational efficiency, reduce inventory recording errors, and provide full visibility into the status of goods inventory in real time."
            ],
            "technology": "Vue, Vite, Express.js, TypeScript, PrimeVue, TailwindCSS, PrismaORM, PostgreSQL, Socket.IO",
            "year": 2025,
            "link": {
                "project": "https://endang-stock-fe.vercel.app",
                "github": {
                    "fe": "https://github.com/Fush1ren/endang_stock_fe",
                    "be": "https://github.com/Fush1ren/endang_stock_be"
                }
            }
        },
        {
            "project_name": "Valnime",
            "path": "valnime",
            "thumbnail_description": "Website for obtaining information about anime. This website can search for anime data and top-rated anime. The anime data used is from JikanApi.",
            "description": [
                "A website application listing anime information built using React.js with TypeScript as the main technology on the frontend. This application aims to present various information related to anime in an interactive and structured manner, such as lists of popular anime, anime details, genres, broadcast schedules, and anime searches by title.",
                "The data in this application is obtained dynamically through the Jikan API, a public API that provides access to data from the MyAnimeList (MAL) website. With this API integration, users can obtain constantly updated information without the need for manual input."
            ],
            "technology": "ReactJs, TypeScript, TailwindCSS, Material UI",
            "year": 2024,
            "link": {
                "project": "https://valnime.vercel.app",
                "github": {
                    "fe": "https://github.com/Fush1ren/valnime"
                }
            }
        },
        {
            "project_name": "Elecbill",
            "path": "elecbill",
            "thumbnail_description": "Website for postpaid electricity payments.",
            "description": [
                "A web-based postpaid electricity payment application built with the aim of making it easier for users to check their bills and pay for electricity online. This system is built with Next.js, JavaScript, TailwindCSS, and PostgreSQL technologies, which together support high performance and secure and efficient data management."
            ],
            "technology": "NextJs, JavaScript, TailwindCSS, PosgreSQL",
            "year": 2024,
            "link": {
                "project": "https://elecbill.vercel.app",
                "github": {
                    "fe": "https://github.com/Fush1ren/elecbill"
                }
            }
        }
    ]
}